<a href="https://colab.research.google.com/github/MadhurimaPaul-87/Python-Data-Analysis-and-Visualization-Bootcamp/blob/main/Handling_Null_or_NaN_values_in_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np 
import pandas as pd

In [4]:
revenue_series= pd.Series([100,200,300,np.nan],index=['Audi','Mercedes','BMW','Toyota'])
revenue_series

Audi        100.0
Mercedes    200.0
BMW         300.0
Toyota        NaN
dtype: float64

In [5]:
revenue_series.isnull()

Audi        False
Mercedes    False
BMW         False
Toyota       True
dtype: bool

In [6]:
revenue_series.dropna()

Audi        100.0
Mercedes    200.0
BMW         300.0
dtype: float64

In [7]:
df1= pd.DataFrame(np.random.rand(12).reshape(4,3))
df1

          0         1         2
0  0.496992  0.654106  0.772123
1  0.068389  0.645715  0.483078
2  0.930415  0.566518  0.702801
3  0.773958  0.521313  0.999421

In [9]:
df1.loc[1,2]=np.nan
df1.loc[2,1]=np.nan
df1.loc[3,0]= np.nan
df1.loc[3,1]= np.nan
df1.loc[3,2]= np.nan
print(df1)

          0         1         2
0  0.496992  0.654106  0.772123
1  0.068389  0.645715       NaN
2  0.930415       NaN  0.702801
3       NaN       NaN       NaN

In [11]:
df1.dropna(how="all")    #only drops a row if all the columns of that row is nan

          0         1         2
0  0.496992  0.654106  0.772123
1  0.068389  0.645715       NaN
2  0.930415       NaN  0.702801

In [12]:
df1.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [13]:
df2= pd.DataFrame([[1,2,3,np.nan],
                   [4,5,6,7],
                   [8,9,np.nan,np.nan],
                   [12,np.nan,np.nan,np.nan]])
df2

    0    1    2    3
0   1  2.0  3.0  NaN
1   4  5.0  6.0  7.0
2   8  9.0  NaN  NaN
3  12  NaN  NaN  NaN

In [15]:
#dropna with thresh parameter
df2.dropna(thresh=3)   #at least 3 numbers in a row should be present otherwise it will drop that row

   0    1    2    3
0  1  2.0  3.0  NaN
1  4  5.0  6.0  7.0

In [16]:
df2.dropna(thresh=2)

   0    1    2    3
0  1  2.0  3.0  NaN
1  4  5.0  6.0  7.0
2  8  9.0  NaN  NaN

In [17]:
df2.fillna(0)

    0    1    2    3
0   1  2.0  3.0  0.0
1   4  5.0  6.0  7.0
2   8  9.0  0.0  0.0
3  12  0.0  0.0  0.0

In [18]:
df2.fillna({0:0,1:50,2:100,3:200})

    0     1      2      3
0   1   2.0    3.0  200.0
1   4   5.0    6.0    7.0
2   8   9.0  100.0  200.0
3  12  50.0  100.0  200.0